_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 48, 48, 1)         0         
_________________________________________________________________
conv1_1 (Conv2D)             (None, 48, 48, 64)        640       
_________________________________________________________________
conv1_2 (Conv2D)             (None, 48, 48, 64)        36928     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 24, 24, 64)        0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 24, 24, 64)        256       
_________________________________________________________________
dropout_1 (Dropout)          (None, 24, 24, 64)        0         
_________________________________________________________________
conv2_1 (Conv2D)             (None, 24, 24, 128)       73856     
_________________________________________________________________
conv2_2 (Conv2D)             (None, 24, 24, 128)       147584    
_________________________________________________________________
conv2_3 (Conv2D)             (None, 24, 24, 128)       147584    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 12, 12, 128)       0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 12, 12, 128)       512       
_________________________________________________________________
dropout_2 (Dropout)          (None, 12, 12, 128)       0         
_________________________________________________________________
conv3_1 (Conv2D)             (None, 12, 12, 256)       295168    
_________________________________________________________________
conv3_2 (Conv2D)             (None, 12, 12, 256)       590080    
_________________________________________________________________
conv3_3 (Conv2D)             (None, 12, 12, 256)       590080    
_________________________________________________________________
conv3_4 (Conv2D)             (None, 12, 12, 256)       590080    
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 6, 6, 256)         0         
_________________________________________________________________
batch_normalization_3 (Batch (None, 6, 6, 256)         1024      
_________________________________________________________________
dropout_3 (Dropout)          (None, 6, 6, 256)         0         
_________________________________________________________________
conv4_1 (Conv2D)             (None, 6, 6, 256)         590080    
_________________________________________________________________
conv4_2 (Conv2D)             (None, 6, 6, 256)         590080    
_________________________________________________________________
conv4_3 (Conv2D)             (None, 6, 6, 256)         590080    
_________________________________________________________________
conv4_4 (Conv2D)             (None, 6, 6, 256)         590080    
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 3, 3, 256)         0         
_________________________________________________________________
batch_normalization_4 (Batch (None, 3, 3, 256)         1024      
_________________________________________________________________
dropout_4 (Dropout)          (None, 3, 3, 256)         0         
_________________________________________________________________
conv5_1 (Conv2D)             (None, 3, 3, 512)         1180160   
_________________________________________________________________
conv5_2 (Conv2D)             (None, 3, 3, 512)         2359808   
_________________________________________________________________
conv5_3 (Conv2D)             (None, 3, 3, 512)         2359808   
_________________________________________________________________
conv5_4 (Conv2D)             (None, 3, 3, 512)         2359808   
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 1, 1, 512)         0         
_________________________________________________________________
batch_normalization_5 (Batch (None, 1, 1, 512)         2048      
_________________________________________________________________
dropout_5 (Dropout)          (None, 1, 1, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 512)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               262656    
_________________________________________________________________
dropout_6 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 512)               262656    
_________________________________________________________________
dropout_7 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 7)                 3591      
_________________________________________________________________
softmax (Activation)         (None, 7)                 0         
=================================================================
Total params: 13,625,671
Trainable params: 13,623,239
Non-trainable params: 2,432
_________________________________________________________________
